:PROPERTIES:
:ID:       0BFC86EF-E8FF-40A7-9C02-838BDE2E8D7D
:mtime:    20231217114822
:ctime:    20230801135235
:END:
#+TITLE: PHP Exceptionのpropertyにあるcodeはuser-defined error code
#+AUTHOR: takeokunn
#+DESCRIPTION: description
#+DATE: 2023-08-01T09:00:00+09:00
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: posts/fleeting
#+HUGO_CATEGORIES: fleeting
#+HUGO_TAGS: php
#+HUGO_DRAFT: false
#+STARTUP: content
#+STARTUP: nohideblocks
* 使用例

以下のように取得できる。
プロジェクト内でエラーコードをintegerで統一できているなら使い道がありそう。

#+begin_src php :exports both
  const ERROR_CODE = 10;

  try {
      throw new \Exception(null, ERROR_CODE);
  } catch (\Exception $e) {
      var_dump($e->getCode());
  }
#+end_src

#+RESULTS:
: int（10）

PHPUnitでcodeを元にexcepionする関数 =TestCase#expectExceptionCode= が生えているのでテスト時に使えそう。
https://github.com/sebastianbergmann/PHPUnit/blob/main/src/Framework/TestCase.php#L430-L433
